# Brewfile - Homebrew package management

# Taps - Third-party repositories
tap "homebrew/bundle"
tap "homebrew/services"

# Core tools
brew "git"                    # Version control
brew "vim"                    # Text editor
brew "curl"                   # HTTP client
brew "wget"                   # File downloader
brew "tree"                   # Directory tree viewer
brew "htop"                   # System monitor
brew "jq"                     # JSON processor
brew "ripgrep"                # Fast search tool (rg)
brew "fzf"                    # Fuzzy finder
brew "bat"                    # Cat with syntax highlighting
brew "exa"                    # Modern ls replacement

# Shell enhancements
brew "zsh"                    # Z shell
brew "zsh-completions"        # Additional completions
brew "zsh-autosuggestions"    # Command suggestions
brew "zsh-syntax-highlighting" # Syntax highlighting

# Development tools
brew "node"                   # Node.js
brew "python@3.11"            # Python 3
brew "go"                     # Go language
# brew "ruby"                 # Ruby (uncomment if needed)

# Version managers (choose one or more)
brew "nvm"                    # Node version manager
brew "asdf"                   # Universal version manager
# brew "pyenv"                # Python version manager
# brew "rbenv"                # Ruby version manager

# Database tools
# brew "postgresql@14"        # PostgreSQL database
# brew "redis"                # Redis database
# brew "mysql"                # MySQL database

# Cloud and DevOps
# brew "awscli"               # AWS CLI
# brew "docker"               # Docker
# brew "kubectl"              # Kubernetes CLI
# brew "terraform"            # Infrastructure as code

# Utilities
brew "gnu-sed"                # GNU sed
brew "coreutils"              # GNU core utilities
brew "findutils"              # GNU find, xargs
brew "tmux"                   # Terminal multiplexer
brew "gh"                     # GitHub CLI

# Security
brew "gnupg"                  # GPG encryption

# GUI Applications (Casks)
cask "visual-studio-code"     # Code editor
cask "iterm2"                 # Terminal emulator
cask "google-chrome"          # Web browser
# cask "firefox"              # Alternative browser
# cask "slack"                # Team communication
# cask "docker"               # Docker Desktop
# cask "postman"              # API testing
# cask "rectangle"            # Window manager
# cask "notion"               # Notes and organization

# Fonts
cask "font-fira-code"         # Programming font with ligatures
cask "font-jetbrains-mono"    # JetBrains programming font

# Mac App Store apps (requires mas CLI)
# brew "mas"                  # Mac App Store CLI
# mas "Xcode", id: 497799835
